import React, { Component } from 'react';

import SobreCard from './SobreCard';

import css from './site/style/sobre.css';
import fav from './site/resources/favicon.png';

class Sobre extends Component {

  render() { 
    
    return (
		<div className="container">
			<link href={css} rel="stylesheet"/>

			<h1 className="text-light">&emsp;Nossos Objetivos:</h1>
				<div className="list-group">
				<span className="list-group-item active">
					✓ Unificar as guloseimas vendidas pelo campus.
				</span>
				<span className="list-group-item" style={{color: 'black', font_family: 'Do Hyeon', sans_serif: true}}>
					✓ Conceber uma experiência intuitiva tanto para quem compra quanto para quem vende.
				</span>
				<span className="list-group-item active">
					✓ Sermos aprovados em Fundamentos de Sistemas de Informação.
				</span>
			</div>
			<br />
			<h1 className="text-light">&emsp;Quem somos?</h1>
			<div className="row">

				<SobreCard nome="André J. Nastari" src="https://www.famousbirthdays.com/faces/zuckerberg-mark-image.jpg" />
				<SobreCard nome="Daniel de Jesus" src="https://scontent.fcgh8-1.fna.fbcdn.net/v/t1.0-9/26993940_1707038555983020_3156101565977383052_n.jpg?_nc_cat=0&oh=7d48b22dcdf7b9740d6acfd7f912c70e&oe=5B5BCB33" />
				<SobreCard nome="Jonathan Ramos" src="https://scontent.fcgh8-1.fna.fbcdn.net/v/t31.0-1/c0.0.960.960/p960x960/12308151_111495845887876_3315119770158820529_o.jpg?_nc_cat=0&oh=af73d023b0b5bca1044dea51540e3d7c&oe=5B9AE86C" />
				<SobreCard nome="Matheus Kurianski" src="https://scontent.fcgh8-1.fna.fbcdn.net/v/t1.0-9/27752046_883746935139021_6995135514314837260_n.jpg?_nc_cat=0&oh=abfbbe61d5aff736f92b219eb4d2fc9c&oe=5B698FF8" className="img-fluid thumb1" width="110px" />
				<SobreCard nome="Talmir" src="https://scontent.fcgh8-1.fna.fbcdn.net/v/t1.0-9/25659388_1617495901648990_718840984269424434_n.jpg?_nc_cat=0&oh=17c973085906225aa4cfa0dee61007b4&oe=5B92E88A" />
				<SobreCard nome="Д̷̨̧̯̖̼̰̘̪̭̻͉̼͕̿̅̌̃̋̓͑̈́́̐̎͌͝ͅp̴̰̫̒̓̾̕y̴̧͓̺̪̗̪̣̺̳̠̍̓͌̓́̈̇͋̄̂̋̌͂̊͜͠ͅг̷̱̂͗̽͝" src="https://scontent.fcgh23-1.fna.fbcdn.net/v/t1.0-0/p370x247/30716216_224850318262427_7538602421291843584_n.jpg?_nc_cat=0&oh=a5e8e3f046054a4d5a4cd61fdf376f81&oe=5B5B2E8A" numero=' ̷̸̸̵̵̷̷̴̶̨̨̡̧̧̢̢̧̢̛̭̝̱̝͇͈͙̥͓̞͉̬̞̟̞̟̝̟̯̯̻̗̪̠̙̮̼̙̞̦͚̭̭̠̹̻͈̹̱̼̬̣͚͍̣̜̭͍͕̱̫͕̻̬̖͕͙̻͉̣̘̝͎̬̗̬͔͕̲̟̠͙͈̝̐̔̒͐͗̀͆̈̿̄̾̇̆̒̿̊̍̀̒̄́̄͊̆̀̀̓̓͑̀̌̇̈̍͛͛̑̔̋̈̿͗͗̒͌͋̀̂͑̊̔̆͊͛̾̓̂͐͛̄̎̑͂̃͌͛̕̕̕͘̚̚̚͜͝͠͝͝͝͝͠͝ͅ6̶̷̸̷̸̸̵̷̵̷̸̴̶̶̵̷̴̶̶̶̷̶̵̶̶̶̸̷̷̨̢̡̧̧̧̢̧̡̡̢̨̢̢̨̡̧̨̨̨̧̡̢̨̛̛̛̛̛̛̛̛̲̗̮̫͖̪̳̙̫͍̥͍͓̹̙̪̥͓̣̫̻͓̘͕͍͔͙͙͈͍̭̮̱̗̜͇̥̺̫̭̫̮̫͖̻͙̹̥͙͚̭͖͔̣̘̮̳̦̰̺̟̮̤̙͙̘̙̯̣͇͖̤̣͈̦̟̰̣̩̲̰͉͈̺̺̲̰̭̱̹͔͉̗̻̬̫̯̳̳͚̪͎̼͎͔͍̱̣̥͚̣̠̥̤̰̣̖̣̣͚̗̣̪̰̬̻̜͇͓͈̤͉͙̥̪̣̘̪̲̳̜̠̘͕͍̯̦̻̙̮̰̳̹͉̘̰̟̰̟͕͉̟̭̯͇͕̭͉̼̗̙̻͈̹͍̱͔̞̖͖͖̝͚̞̫͎̰͍̰̭͍̲͙̮̳̝̂̌̈́͊͊̑̑́́̽̍́̅̾̾͛̔̽̓̀́͊̏̌̈̍̓͗̈́̿̏́̂͊̂͐̃̊̔̾̈́̌͑̏̌̄̋̃̽̋́̏̋͗̈́͒̍͐͆̈́̏̒̄̅͌̾̐̓͗̿͆̋̇̌̋̒̓̔̒̽̇́͋̋̈́̀̿͛́̅̎͋̽̋̂̒̒̿̄̂͊̀̽̀̓̅̔͒͗̈́͒́͒̈́̏̇͂̓͐̓̋̉͐͑͒̏̑͛͑̂̅̿̒͆̂̑̓͂͒̇̔̄͋̿͒̅͑̃́̎͛̃̏̋̅͗̈́̈͗͒̊̍͌̔̒̃̐̀͋̍̈́̓͋̈́̉͆̎̄͌͂͊̽̍̈́̄̎̓́͐͆̌̌͋̐̈́̇̕̚͘͘̚͘͘̚̚͘͘͘̚̕͘̚̚̚͘̚̚͘͘͜͜͜͜͜͠͠͝͝͝͝͝͠͝͝͝͝͝͠͝͠ͅͅͅͅ6̴̷̶̴̴̷̴̷̸̸̷̸̸̶̢̡̡̨̨̨̨̛̛̛̛̛̛̪̻͓̱̞̤̤̝̙̺̭͕̲̱͔̫̮̼̤͙̭͇͕̻͙̮̙͇̰̤͍͖̱͇̮̱̞̣̺̺͎̥̣̙̰̤̳͓͍͈̼͔̦̹̲͇̙̞͓̯̥͍̞̝̣̠̦̮̪̜̤̹͚̮͍͚͙̖̹̘͓̙̤̝̙͕̰͈̳͔̯̬̟͇͓̠͉̝͖͔̹͕̫̹̯͂̈́́̊͂̽̐̃͒̑̒̔̈̈́̽́͐̔̉̐̉̿̐̎̉͆̿͗̍͂̈́̄̆̅͑̌̄̅̿̂̍͂̎̈́́̅͆̿̏͐̈̃̀͒̀̊͌̆̆͂͐̑̋̈́̌͒̔̌̆̇͛͑̆̆͗̿̽̅͐̄̿̈̽͒̑͆̑̆̋͛̉͐̀̕̕̕̚͘͘͜͜͝͝͠͝͝͝͝͝ͅ-̴̸̷̸̴̵̸̵̴̴̶̷̶̸̸̸̸̸̶̵̷̴̵̢̨̨̨̧̢̧̡̡̡̡̧̡̨̢̧̨̧̨̡̛̛̤̮͇͍͉͈̝͕̠̭̪̱̪̬̞̦̭͖͓̙͎̘̳̗̺̯̝͕̪̘̮̲̰͖̫̮̗͙̜̖̼̝̭̣̬̗͕̟͈̺̳̻̺̭͈̻̻̬͎̦͚̝͎̯̮̰͎̫͔͈̩̫̦̰̼̞̣͕͚͔͎̟̰͍͕̫̭͇͚̫̼̣̠̺̗͎͈̪̲̲̤͉̼̖̳̣͎͓͔̞̞̫̟̱͕̖͔͚͙͈̥̘̝̼̻̬͔͕͓͙̘̳͉̙̻̠͓̱̙̫̙͕̤̗͕̜̪͙̦̝̦̙͇̺̩̪̩͕͚͖͇̼̬͕̟̹̳̀̍̾͊̋̆̃́͆̀̀̆̓͂̿̆̈́̀͒̈́̀̔̈́͌̈́̍͛̄͌̃̉̀͛̓́̂́̿̓̔͒͐̈́̉͑̿͌͆̅̀͐̈̔̏̾̓͂͊͂͑́͑̿́̉͗̈́̊̀̊̓͂͊͒̉̒͂͗̽̓̐̆̓͆̀̍̂̽̇̂̾̾̈́͗̐̀͑̐̀͑̈́̐̈́̽̀͆̓̀͂̃̒͆̽̔̑̑̅̀̆̿̎͑͆̇͑̑̅͐̑̍̾̃͒̈́͂̔͒̇͒̍̃̄͑͌̌͛̒̿̽͐͐͛́̔̍͒͋͂͌̾̀͒̿̂̉̅̑̈́͂̿̌̇̀́͘̕̚͘̚̚͘͘͘̚͘̚͜͜͜͜͜͜͠͝͝͝͝͝͝͝͝͠͝͠͝͝ͅͅͅс̷̵̶̸̴̷̷̸̷̴̵̵̶̴̸̸̵̸̵̧̨̨̡̧̨̡̨̨̢̨̨̨̡̨̧̧̡̡̛̛̛̛̛̖̻̘͈̞͈̘̲̮̠͚̯͈̜͈̞̺̺͚̗̳͚̭͉͎͓̞̯̗͎̦͙̪̭͖͇̳̰̰̟̞͔̣̣̣͕̠̱̼̦̩̳̬̱͈͓͎̖̳̤̪̲̬͍͇͎͇͉͖̳̣̮̙̲͙̙̻̺͈͍͚̠̣̦͈͈̹̪̱̺̫̫̣̩̠̤̜̮̩͍͚͈͕̺̜̺̘̘͎̻͈̖̞̺̘̪̩̥̬̺̖͖̼͙͕̠̺͖̗̱͓̥͈̼̯̙̙̖̘͕̗͙͉͙̳̝͎͈̜͉̱̗̖͙̜̯̙͇̰͕̟̣͇͈̗̮͑̾̓̽̓̈́͊̏͂͋͐̒̎͊͛̂̆̓͌̃̏͂͋͑̆͊̉͋̈͊́̂̈́̈̈́̏͆̑͊̈́̈́̌̇͗͌̈̑̑̄̆͒̔͋͒̑͛̽͆̋̓̍̐̆̈̈́̒̏̓͛͛̔̈́́̽̆̓̎̓̿͒͆͊͆́́̋̈̉̈́̍̿̈́̆͊̂́͆͗͗̂̏̿̈́̽͌̊͊̊̉̑̇̈̇́̋͋̃͊̓̾͐̒̐̃͘̕̚̚͘̕͘̚̕̕̕̚͜͜͜͜͠͠͝͠͠͝͝͠͠ͅͅͅͅͅм̶̵̷̷̴̸̴̷̶̴̶̵̵̴̵̵̵̵̶̷̶̸̧̡̢̢̢̧̢̨̨̢̧̧̨̢̨̛̛̜̞̪̞͉̞̙̳̠̖͎̩͓͖̺͎̱͚̩̼̹̙̟̻͚̣̩̱̝͙̗̻̫̠̘̬̭̻͙̯̗̜̦̼̣̜̗͎̯̜̲͚̬̱̟̯̪͇̱̩̞̼̳̹͈̦̹̼̬̝͇͙͓̱͓͙͓̖̻̯͍̘̗̫̭̤͈̦̝͇̻̮͔̠̦̦̤͎̰͍̰͉̱̘̰̥̜̠̲͓̳̝͎̰̥̗̥͖̦̲̲̙̫̰͑́̂́̑̑̆͒̃̀͊́͋̃͑̈́̈̀́̒̃̐͂̆̊̋͆́͊̔́̐̃͒̎̿̈́̊̆̓̔̋͊̑́̌̀̃͒̈́͋̿̽̍͆̉̐̍̉̂͗̃̎͌̓͗͑̈̊́̊͛̈́͒́̃̂̓̆̆͌̿͒̋̔̃̌̑̉͂̿̄̔̋̌̃̇̏̓̓͂́̓̏̿̍̂̀̇́͌̕̚̕̚̕͜͜͜͜͜͝͝͝͠͠͝͝͝͝͝͝͝͠͠͝ͅͅͅͅе̷̸̵̴̴̶̷̴̵̸̷̷̴̸̶̷̷̢̡̡̢̨̨̛̛̛̛̛̛̼̠̞̝̣͍͎̹͉̬̻̩͙͇̬̖̩͖͓͕͙̹̭̝̫̱͈̮̬̻͙̹̜̺̝̺̣̤͖͔̟̺͎̹̘̦̰̗͖̥͍̤̫̘̮̦͇͓͓̘͇͉̩͖̖̖͔̥̪͓̬̙̤̺͔͛̃͑̈́͊̌̎̐̈́̐̓̀͐͒̽̈́̉͑̌̐̒͂̇̾̈́̈́͆̑͌͗̽͊̽͌̂͒̊́̌̋̈́͊̐̓̌͐͗̾̈́͋̄̇͒̉͑̿̅̇͐͑͂̒͑͒̑̿̓̆̿͋͆͒͒̄̈́̈̆̎͂̔̉́͆̾̈͂̓̏̓̅̀̀́͊͛͛̈́̓̉̓̽́́̉͊͗̑̈́̎̏́͌̒̑̃̇̉͋̾̆̃̈̿̇͒̇̅͋́̆́̈̋̊͆̿̃͌͆̅̍̈̚̕͘̕̚̕͘̚͜͜͝͠͠͝͠͝͝͝͝ͅͅͅр̸̸̵̶̵̵̴̶̸̸̴̢̡̡̢̧̛̛͓͚̘̫̦͔͔̯̻̣͕͎̣̳̰̗̯͉̭̭̣͇̥̰̰͖̜̭̖̙̦̬̣͎͇͖̭͖̫̼̭̫͚͖͉͙̬̣͔̭̱̟̤̜͇̹̲̳̱̫͉̻͙̹͈͚̖̜͈̙̭̫̣͍͎̥̬͉͍̣͓̺͈̮͓̻̮͖̝͒̃̅͑͛͛̐͆̎͑̾̅̈́͒͊̈́̃̾̅͋̑̄̈͌̄̈́̽̔͌̉̀̈́̈̓̓̍̄͛͐̾́̉̍̈́͋̋̇̆́̓͗̆͊͛̎̅̒͗̆̃́̄̿̏͌͊̿̇̈́̇̚͘͜͝͝͝͝ͅͅт̶̴̸̸̷̸̵̵̸̶̴̶̸̴̴̷̴̵̶̵̷̷̸̸̧̨̨̡̨̨̧̧̢̡̡̨̡̢̢̧̧̡̧̡̢̧̛̛̞͖̦̫͓͓̤͙̬̹͈̤͉̳̼̭̜͕̝͉̺̪͉̺̙̘͙̜̱̥̹̜̲̳̻͕̰̩̙̞̪͈̼̗̦͉̳͔̞̻̲̪͉̜͖̪̥̙̲̻͓̻̩̘̙̰̫͇̪̱̲͚̻̮̯͙̱͈̖̦̥̰̖͍̲͔͇͚͚̻̟͚̩̲̯̝̯̻͇̹̫͉̗͕̬̜̖̗̖͍͈͈͈̖̳̪̜̻̳̲̤͎͈̱̮͔͕͙͍̥͍̗̮̭̲̤̣̭̪̤̹̱̩͕̤̻̭͇̘̳̬̦͎̝̥̱͇̩͎̩̘̦̱̘̣̗͉̼͖̟̪̙̜͇͓̊̋́̄́̔̾͗̀̍̍̈́̌̂͋͐̑͆̃͒͒͒̀̃̆́͛̇͗͊͋͐̅͗̆͒̈́̌͑͌̄̈́͐̃̀̍͒̈̄̇̏̈͒̾̄̑͆̑́̑̐͛̿͌͗̑̑̄̿͂͛͑̄̓̎́͌̽̅͂͐̽͑͂̀̄̋̀̆͒̽̈́̅͂́̔̀̊̍̈́͋͛̓͆̆́̌̆͒͊̉̏̔͑͊̋̒͂̀̏̽͌̊̈̆̏͒͗̔̌́̋̂̿̈̋̚̕̕͘͘̚̕̚͜͜͜͜͜͜͠͝͝͝͝͝͝͝͝͝͠͠ͅͅͅͅь̵̶̷̴̸̸̶̴̴̷̴̷̴̶̴̶̴̨̢̧̢̡̨̡̢̧̧̧̧̡̨̡̛̛̻̻̭̫̻͙̱̣͈͔̙̟̟̳̼̱͚̙̞̹͕̺̗̜̥͙̳͎̗͇͎̥̺͇̪͖͔̦̣̩͔̺̥̻̖̲̜̙̰̝̟̼̦̻̜̥̠͓̝̙̟̤͍̮̜̞͈̞͙̫̹͎̲͖͉̬͍̳̱̜̙̲̭͕͈͕̞͍̱̲̬͍̘̗̳̯̲̣̬̲̪̦̖͖͎͇͙̯̫̹͕̙͍̮́̈̾̔̉͋̃̾̾̑͒̅͑̾̈́̆͑̈́̀͂̈́͒̈́͑̂͊͊̏̔̂͒͊͗̀̎̓͗͋͌̐̑̀͐̈̂͊͛̾͆͗̊̀̆̂́͒͋͒̏̀̔͊͑͌͌̆̀̂̎̾̉͐̔̋͆͒̍̐̈́͛͌͒̌̐̌͗́̾̃͒̂͂̾͗͑̆͑̀̓̑̃̄̽̈́̐͛̏͌͛̄͆̈̌̆̂̓͂̕̚̚̕͜͜͜͝͠͝͝͠͝͝͝ͅͅ"̵̢̮͓̦͇̠͎̈́̓̌͐̏͛͗̐̔̕  ' />

			</div>
		</div>
    );
  }
}

export default Sobre;